spec/fixtures/payments/create.yml

---
http_interactions:
- request:
    method: post
    uri: https://sandbox.bitex.la/api/merchants/payments
    body:
      encoding: UTF-8
      string: '{"data":{"type":"payments","attributes":{"type":"payments","amount":100,"currency":1,"keep":10,"callback_url":"https://myawesomesite.com/webhook","customer_reference":"Purchase
        at My Store","merchant_reference":"Sale id: 2212"}}}'
    headers:
      User-Agent:
      - Faraday v0.9.2
      Authorization:
      - write_level
      Version:
      - '2.0'
      Content-Type:
      - application/vnd.api+json
      Accept:
      - application/vnd.api+json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      X-Frame-Options:
      - SAMEORIGIN
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Content-Type:
      - application/vnd.api+json; charset=utf-8
      Etag:
      - W/"527119d37a5fa1b19afc76e5120de1e3"
      Cache-Control:
      - max-age=0, private, must-revalidate
      Set-Cookie:
      - _bitex_la_session=anUycHcwdVhxVnJ3TTBQOW45bjM5VUxQSnBvWmxORSt1TGhsSzVBUEFNWWJQV2NGbW5BWXJGancwOFJjZksra0xTbW9VcTR1bmFPNUEydDh1SS8ySUJvMjVJdVBjdjNqdE5CbndPbTJWOEp2N3BqZUhZUWhGbWRPek1ud1VXVmRSYmtyNWdLdTVlMGRPWGFpcUl0OUhlMDdFeVc1NmtPcUJnYmY1T3lqRGdBPS0tM3VZaFpDVEwxOXB5dGNJaEQrNE01Zz09--2ded7a13920f35193d5e6e32e67abaa6e7d43a13;
        path=/; HttpOnly
      X-Request-Id:
      - '0595ff4b-54a5-45f5-8f3c-6efd623f4cd1'
      X-Runtime:
      - '2.871504'
    body:
      encoding: UTF-8
      string: '{"data":{"id":"5","type":"payments","attributes":{"amount":100.0,"callback_url":"https://myawesomesite.com/webhook","confirmed_quantity":0.0,"currency":"btc","customer_reference":"Purchase
        at My Store","expected_quantity":100.0,"keep":10.0,"kept":null,"last_quoted_on":"2018-12-02T22:22:50.867Z","merchant_reference":"Sale
        id: 2212","overpaid":null,"quote_valid_until":"2018-12-02T23:22:50.709Z","settlement_amount":null,"settlement_currency":null,"status":"pending","unconfirmed_quantity":0.0,"valid_until":"2018-12-02T23:22:50.709Z"},"relationships":{"address":{"data":{"id":"29","type":"bitcoin_addresses"}},"coin_deposits":{"data":[]}}},"included":[{"id":"29","type":"bitcoin_addresses","attributes":{"auto_sell":false,"public_address":"mipLWqDPAfr2cAcGC8GFbfLLbcY4sWnxA5"},"relationships":{"user":{"data":{"id":"7","type":"users"}},"payment":{"data":{"id":"5","type":"payments"}}}}]}'
    http_version: 
  recorded_at: Sun, 02 Dec 2018 22:22:51 GMT
recorded_with: VCR 4.0.0
