spec/fixtures/payments/find.yml

---
http_interactions:
- request:
    method: get
    uri: https://bitex.la/api/merchants/payments/328
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Faraday v0.9.2
      Authorization:
      - 4df79d05ce6fc1baeb1a4d14d303638aa4a866fa82cb686c05051959a07c02371ea4e38e9edd78ab
      Version:
      - '2.0'
      Content-Type:
      - application/vnd.api+json
      Accept:
      - application/vnd.api+json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Tue, 22 Jan 2019 15:49:16 GMT
      Content-Type:
      - application/vnd.api+json; charset=utf-8
      Transfer-Encoding:
      - chunked
      Connection:
      - keep-alive
      Set-Cookie:
      - __cfduid=de932128f2cc2153c7d0b705f44ea060b1548172156; expires=Wed, 22-Jan-20
        15:49:16 GMT; path=/; domain=.bitex.la; HttpOnly
      - _bitex_la_session=K3VXZlJYVzhWLzVQRnR4UmJqTmVSZUEvMFBNcm5YdzRNbkIxWjBLc0hpeGhscDZWNzRWMmR6ZEVCN1BTRkZ3RmFVbExybHQ3NG1xZzJKVTQrTy9aMk5BeFZBQXJYM0czcnFmMG9zVFJQa1NDOXFnNjhnc21oT2N0eHRRYVlEaGstLUR6QWpFVjJqT29xdXZ6OHB4L1RyMWc9PQ%3D%3D--7be532af7524803ce9afde4e1105b644e2700a36;
        path=/; secure; HttpOnly
      X-Frame-Options:
      - SAMEORIGIN
      X-Xss-Protection:
      - 1; mode=block
      X-Content-Type-Options:
      - nosniff
      Etag:
      - W/"36329a198f8c0f6f1571272b18dfac80"
      Cache-Control:
      - max-age=0, private, must-revalidate
      X-Request-Id:
      - 79650f76-29a1-4abe-9d90-69cadba89d40
      X-Runtime:
      - '0.397616'
      Strict-Transport-Security:
      - max-age=15552000; includeSubDomains; preload
      Expect-Ct:
      - max-age=604800, report-uri="https://report-uri.cloudflare.com/cdn-cgi/beacon/expect-ct"
      Server:
      - cloudflare
      Cf-Ray:
      - 49d32b67ecbf80dc-SCL
    body:
      encoding: ASCII-8BIT
      string: '{"data":{"id":"328","type":"payments","attributes":{"amount":10.0,"callback_url":null,"confirmed_quantity":0.00285,"currency_code":"ars","customer_reference":"Tarjeta
        Azul","expected_quantity":0.00285,"keep":10.0,"kept":0.00285,"last_quoted_on":"2015-09-03T14:31:37.000Z","merchant_reference":null,"overpaid":0.0,"quote_valid_until":"2015-09-03T14:32:37.000Z","settlement_amount":null,"settlement_currency":null,"status":"settled","unconfirmed_quantity":0.00285,"valid_until":"2015-09-03T15:31:37.000Z"},"relationships":{"address":{"data":{"id":"38500","type":"bitcoin_addresses"}},"coin_deposits":{"data":[{"id":"2920","type":"coin_deposits"}]}}},"included":[{"id":"38500","type":"bitcoin_addresses","attributes":{"auto_sell":false,"public_address":"19ygohr288PgzQxer2qHoJ3UeMacDM1KWc"},"relationships":{"user":{"data":{"id":"3197","type":"users"}},"payment":{"data":{"id":"328","type":"payments"}}}},{"id":"2920","type":"coin_deposits","attributes":{"coin":"btc","amount":0.00285,"created_at":"2015-09-03T14:51:12.000Z"},"relationships":{"address":{"data":{"id":"38500","type":"bitcoin_addresses"}}}}]}'
    http_version: 
  recorded_at: Tue, 22 Jan 2019 15:49:16 GMT
recorded_with: VCR 4.0.0
